<template>
  <h1>一个人的信息</h1>
  <h2>姓名：{{ name }}</h2>
  <h2>年龄：{{ age }}</h2>

  <button @click="sayHello">说话</button>
</template>

<script>

export default {
  name: 'App',



  async setup() {
    //数据
    let name = '张三'; // 多个函数声明时用分号'；'不是用逗号','// 多个函数声明时用分号'；'不是用逗号','// 多个函数声明时用分号'；'不是用逗号','// 多个函数声明时用分号'；'不是用逗号','// 多个函数声明时用分号'；'不是用逗号','// 多个函数声明时用分号'；'不是用逗号','// 多个函数声明时用分号'；'不是用逗号','// 多个函数声明时用分号'；'不是用逗号','// 多个函数声明时用分号'；'不是用逗号','// 多个函数声明时用分号'；'不是用逗号','// 多个函数声明时用分号'；'不是用逗号','// 多个函数声明时用分号'；'不是用逗号','// 多个函数声明时用分号'；'不是用逗号','// 多个函数声明时用分号'；'不是用逗号','// 多个函数声明时用分号'；'不是用逗号','// 多个函数声明时用分号'；'不是用逗号','// 多个函数声明时用分号'；'不是用逗号','
    let age = 18

    //方法
    function sayHello() {
      alert(`我叫${name}，我${age}岁了，你好啊！`)
    }

    //返回一个对象（常用）
    return {
      name,
      age,
      sayHello
    }

  }
}
</script>

